'''
Дана непустая строка. Вывести коды ее первого и последнего символа
'''
s = input("Введите строку: ")
print("Код первого символа:", ord(s[0]))
print("Код последнего символа:", ord(s[-1]))
